<?php 

/* 
if ($_SERVER["REQUEST_METHOD"] == "POST") {
- এই লাইনটি চেক করে যে ফর্মটি POST মেথড ব্যবহার করে সাবমিট করা হয়েছে কিনা। যদি POST মেথড ব্যবহার করে সাবমিট করা হয়, তাহলে এর ভিতরের কোড এক্সিকিউট হবে।



name, email, এবং message ফিল্ডের ডেটা সংগ্রহ করে। trim() ফাংশন ব্যবহার করে ডেটার শুরু এবং শেষের স্পেস (ফাঁকা স্থান) মুছে দেওয়া হয়।

if (empty($name) || empty($email) || empty($message)) {
--> এই অংশটি চেক করে যে name, email, এবং message ফিল্ডগুলো খালি কিনা। যদি কোনো ফিল্ড খালি থাকে, তাহলে ব্যবহারকারীকে index.php পেজে রিডাইরেক্ট করা হবে or error message দেখাবে।



if(!filter_var($email, FILTER_VALIDATE_EMAIL)
email ফিল্ডে দেওয়া ইমেইল ঠিকানা সঠিক ফরমেটে আছে কিনা. সঠিক ফরমেটে না থাকে, তাহলে ব্যবহারকারীকে index.php





*/